{
  "start": {
    "id": "start",
    "text": [
      "🧨 Scene: Welcome to the ER — Please Take a Number",
      "It didn't start with an ambulance. It started with pain. Not just any pain — *character development pain*. The kind that wakes you up at 3am, folds you in half like a crusty yoga mat, and whispers, *“Good luck, bitch.”*",
      "You were a “good patient,” remember? You played the game. You did the fiber. The yoga. The low FODMAP sad beige diet. You smiled through the lectures, the pamphlets, the “have you tried breathing?” energy. You even kept your voice calm while the 12-year-old resident explained your own body to you like he was giving a TED Talk called “It’s Just IBS, Sweetheart.”",
      "You’re not a doctor, but you **are** a PhD in physics with decades of lived experience in *“something is very wrong with my stomach and no one believes me.”* You’ve worked in high-tech labs, helped bring 3D-printed products to life, and now? You’re curled in the fetal position, vibrating like a dying Roomba, covered in flop sweat and regret.",
      "You haven’t eaten in three days. A bite of yogurt sent you into a full-body exorcism. Even water is playing hard to get.",
      "Your partner tiptoes in, haunted. “Do you think it’s time to go to the ER?”",
      "You nod. The Go Bag is already packed."
    ],
    "choices": [
      {
        "text": "🚑 Let the Sadist Squad roll you into the ER",
        "nextId": "er_arrival_expanded"
      },
      {
        "text": "📱 Start a TikTok while literally dying",
        "nextId": "tiktok_waiting_exposed"
      },
      {
        "text": "🧓 Talk to Gladys, who’s been waiting even longer",
        "nextId": "meet_gladys"
      },
      {
        "text": "📢 Advocate politely for yourself",
        "nextId": "early_confrontation"
      },
      {
        "text": "🚪 Refuse the ambulance and hobble home medieval-style",
        "nextId": "ambulance_refusal"
      }
    ],
    "resources": [
      {
        "title": "Understanding Medical Gaslighting",
        "url": "https://www.healthline.com/health/medical-gaslighting"
      },
      {
        "title": "Chronic Illness and Medical Trauma",
        "url": "https://www.psychologytoday.com/us/blog/the-truth-about-exercise-addiction/201808/chronic-illness-and-medical-trauma"
      },
      {
        "title": "Patient Advocacy Resources",
        "items": [
          "How to Document Your Symptoms Effectively",
          "Questions to Ask Your Healthcare Provider",
          "Understanding Your Rights as a Patient"
        ]
      }
    ],
    "navigation": [
      {
        "text": "🔁 Start this story over from the beginning",
        "nextId": "start"
      },
      {
        "text": "🏠 Return to Main Menu (More stories coming soon!)",
        "nextId": "start",
        "comingSoon": true
      }
    ]
  }
}