{
  "start": {
    "id": "start",
    "text": [
      "🧨 Scene: Welcome to the ER — Please Take a Number",
      "It didn't start with an ambulance. It started with a year of gaslighting.",
      "You were a good patient. You went to every appointment, even when you had to leave work early, bike two hours with your stomach in knots, or beg friends for rides. You tolerated it all — the rotating cast of medical residents who never read your chart, the endless loop of 'eat more fiber,' 'take Miralax,' 'do yoga,' and the cherry on top: 'Are you here for drugs?'",
      "You told them, every time: 'This is NOT a case of IBS. I'm an ultramarathon runner. I eat like a vegan wellness influencer. I've taken everything you've prescribed—multiple times—as written. And I'm still in agony.'",
      "They nodded sympathetically and prescribed a different flavor of useless.",
      "You worked at a 3D printing company, finally with decent insurance. Stanford Hospital was twenty minutes away. The GI clinic was walking distance from your job. You thought that meant something.",
      "It didn’t.",
      "Stanford gave you the same shrugs and suspicion that Medi-Cal did — just with nicer furniture.",
      "After months of vomiting, bloating so severe none of your clothes fit, and appointments that went nowhere, you stopped hoping. You started surviving. You stayed late in the lab to make up for time lost to vomiting in your car or sprinting to the bathroom mid-client meeting. You popped antiemetics like mints — which you'd been on since middle school, by the way, because this didn't start last year. This started decades ago. No one ever took it seriously.",
      "Rather than sympathy and help, fighting the urge not to throw up in the middle of meetings (and often failing) earned you the label of 'unreliable employee'. It's not long before your b*tch of a boss puts you on an extensive PIP for <gasp!> fighting a serious and life-threatening chronic illness.",
      "Then came the night everything broke.",
      "You wake up feeling like a team of ninjas has been stabbing you in the belly all night. The pain is relentless — twisting, bloating, pulsing — and you can't tell if it's your intestines or a demon.",
      "But the pain — the pressure — it felt like you'd swallowed a basketball.",
      "You couldn't stand. Couldn't walk. Couldn't breathe without crying.",
      "The pain in your stomach becomes unbearable. You can't walk. You're doubled over, gasping, sweat pouring down your face. You plead with your partner to call 911.",
      "The paramedics arrived. Professionals, supposedly.",
      "Your partner has to spend twenty minutes convincing them that you're not nine months pregnant and in labor. The bloating is so extreme you look like you've swallowed a basketball. Your skin is stretched tight — so tight you're surprised you don't burst into stretch marks."
    ],
    "choices": [
      {
        "text": "📢 Speak up about your treatment",
        "nextId": "confrontation"
      },
      {
        "text": "😶 Stay silent and wait it out",
        "nextId": "waiting_game"
      },
      {
        "text": "🚑 Continue to the ER in the ambulance",
        "nextId": "er_arrival_expanded"
      },
      {
        "text": "🚪 Escape the ambulance and go back home",
        "nextId": "escape_ambulance"
      }
    ],
    "resources": [],
    "navigation": [
      {
        "text": "🔁 Start this story over from the beginning",
        "nextId": "start"
      },
      {
        "text": "🏠 Return to Main Menu (More stories coming soon!)",
        "nextId": "start",
        "comingSoon": true
      }
    ]
  }
}